Project 2 Notebook Concert Data

In [1]:
#Dependencies
import pandas as pd
import numpy as np
import json
import requests
import time
from pandas import json_normalize
import os
import csv

In [2]:
#Reading in mtv genre information and converting it into dataframes
concert_total_path = "new_csv/concert_total.csv"

concert_data = pd.read_csv(concert_total_path)

In [3]:
concert_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 534 entries, 0 to 533
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     534 non-null    object
 1   date     534 non-null    object
 2   tickets  532 non-null    float64
 3   gross    534 non-null    int64
 4   month    534 non-null    int64
 5   year     534 non-null    int64
dtypes: float64(1), int64(3), object(2)
memory usage: 25.2+ KB

In [4]:
concert_data.head()

             name       date   tickets    gross  month  year
0  Paul McCartney   1/9/2015  124062.0  7424081      1  2015
1  Paul McCartney  1/22/2015   68745.0  5153749      1  2015
2  Paul McCartney   2/5/2015  101863.0  6729532      2  2015
3      Billy Joel  3/20/2015   37064.0  3924448      3  2015
4   Kenny Chesney  3/26/2015   43630.0  3776207      3  2015

In [5]:
concert_count_month = concert_data.groupby(["month"]).count()
concert_count_month

concert_count_month.to_csv("new_csv/concert_count_month.csv")

In [6]:
concert_count_year = concert_data.groupby(["year"]).count()
concert_count_year

concert_count_year.to_csv("new_csv/concert_count_year.csv")

In [7]:
concert_count_both = concert_data.groupby(["year", "month"]).count()
concert_count_both

concert_count_both.to_csv("new_csv/concert_count_both.csv")